#!/bin/bash 
#echo $0                                    #    //脚本的名称
#echo $1                                     #   //第一个参数
#echo $2                                      #  //第二个参数
#echo $*                                       # //所有参数
#echo $#                                        #//所有的综合
#echo $$                                       # //当前进程的进程号
#echo $?                                       # //上一个程序的返回状态码
cd /rendir
for i in `ls *.doc`            #注意这里有反引号
do
    mv $i  ${i%.*}.txt    #从右往左，最短匹配删除 格式：${变量名%关键词*}
done                      #从左往右，最短匹配删除格式：${变量名#*关键词}
